In [1]:
import os
from pathlib import Path
import xmlrpc.client
import pandas as pd
from sqlalchemy import create_engine

In [2]:
def api_params_func(test_db: bool = False) -> dict:

    api_url = os.environ.get('ODOO_URL_API')
    api_db = os.environ.get('ODOO_DB_API')
    api_test_db = os.environ.get('ODOO_DB_PRUEBA_API')
    api_username = os.environ.get('ODOO_USERNAME_API')
    api_clave = os.environ.get('ODOO_CLAVE_API')


    api_params = {}
    if test_db:
        api_params['api_db'] = api_test_db
    else:
        api_params['api_db'] = api_db


    common = xmlrpc.client.ServerProxy(f'{api_url}/xmlrpc/2/common')
    uid = common.authenticate(api_params['api_db'], api_username, api_clave, {})
    models = xmlrpc.client.ServerProxy(f'{api_url}/xmlrpc/2/object')


    api_params['api_clave'] = api_clave
    api_params['api_uid'] = uid
    api_params['api_models'] = models

    return api_params

In [3]:
def search_costo_ventas_func(mes: int, tolerance: list) -> list[str]:
    
    if type(mes) != int or mes < 1 or mes > 12:
        raise Exception (f'El mes es incorrecto. El párametro "mes" debe ser un número entero entre 1 y 12. Escribiste: {mes}')
    
    if type(tolerance) != list or len(tolerance) != 2:
        raise Exception (f'La tolerancia debe ser una lista de sólo dos elementos')

    if type(tolerance[0]) != int or type(tolerance[1]) != int:
        raise Exception (f'Los elementos de la lista de tolerancia deben ser sólo números tipo enteros')
    
    param_dia_hr_ini = pd.Timestamp(2024, mes, 1) + pd.Timedelta(hours=7)
    param_dia_hr_fin = pd.Timestamp(2024, mes+1, 1) + pd.Timedelta(hours=7) - pd.Timedelta(seconds= 1)
    
    param_dia_hr_ini_tolerance = param_dia_hr_ini - pd.Timedelta(days = tolerance[0])
    param_dia_hr_fin_tolerance = param_dia_hr_fin + pd.Timedelta(days = tolerance[1])
    
    search_costo_ventas = [
        "&", "&",
            ("state", "in", ["purchase", "done"]),
            ("date_approve", ">=", param_dia_hr_ini_tolerance.strftime('%Y-%m-%d %H:%M:%S')),
            ("date_approve", "<=", param_dia_hr_fin_tolerance.strftime('%Y-%m-%d %H:%M:%S')),
        ]

    return search_costo_ventas

In [4]:
def mes_to_string_func(mes: int) -> str:
    
    if type(mes) != int or mes < 1 or mes > 12:
        raise Exception (f'El mes es incorrecto. El párametro "mes" debe ser un número entero entre 1 y 12. Escribiste: {mes}')
    
    match mes:
        case 1:
            mes_to_string = 'enero'
        case 2:
            mes_to_string = 'febrero'
        case 3:
            mes_to_string = 'marzo'
        case 4:
            mes_to_string = 'abril'
        case 5:
            mes_to_string = 'mayo'
        case 6:
            mes_to_string = 'junio'
        case 7:
            mes_to_string = 'julio'
        case 8:
            mes_to_string = 'agosto'
        case 9:
            mes_to_string = 'septiembre'
        case 10:
            mes_to_string = 'octubre'
        case 11:
            mes_to_string = 'noviembre'
        case 12:
            mes_to_string = 'diciembre'

    return mes_to_string

In [5]:
def get_dfs_from_database(db_mode: str, mes_to_string:str) -> list[pd.DataFrame]:
    
    if db_mode.lower() == 'local':
    
        db_file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/comisiones.db'))
        engine = create_engine(f'sqlite:///{db_file_path_str}')

        with engine.connect() as conn, conn.begin():
            ventas = pd.read_sql_table(f'ventas_{mes_to_string}', conn, dtype_backend='numpy_nullable')
            try:
                ultimo_costo = pd.read_sql_table(f'ultimo_costo_{mes_to_string}', conn, dtype_backend='numpy_nullable')
            except:
                ultimo_costo = None

        engine.dispose()
    

    elif db_mode.lower() != 'local':
        raise Exception (f'Sólo existe la base de datos "Local"')


    return ventas, ultimo_costo

In [6]:
def _get_df_from_excel(file_name:str, file_sheet:str, file_location:str) -> pd.DataFrame:

    file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/{file_location}/{file_name}'))
    df = pd.read_excel(file_path_str, sheet_name=file_sheet, dtype_backend='numpy_nullable')

    return df

In [7]:
def prov_locales_df_from_excel() -> list[pd.DataFrame]:
    
    file_name = 'proveedores_oficiales.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'compras'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    prov_oficiales = df.loc[df['oficial'] == 1][['partner_id', 'partner_name']]
    prov_locales = df.loc[df['oficial'] == 0][['partner_id', 'partner_name']]

    return prov_oficiales, prov_locales

In [8]:
def ultimo_costo_sae_df_from_excel() -> list[pd.DataFrame]:
    
    file_name = 'ultimo_costo_sae.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    return df

In [9]:
def calificados_fase_c_df_from_excel() -> list[pd.DataFrame]:

    file_name = 'calificados_fase_c.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    # Check que verifica que todas las líneas de compra estén calificadas
    if pd.NA in df['calificacion'].unique():
        print('¡Cuidado!, tienes líneas de compras "line_id" sin calificar')
        return None
    
    df['calificacion'] = df['calificacion'].str.upper()
    calificados_fase_c_OK = df.loc[df['calificacion'] == 'OK'] # Líneas 'line_id' que tienen un match con 'fact_line_id'
    calificados_fase_c_B = df.loc[df['calificacion'] == 'B'] # Líneas para regresar a la fase B y que el algoritmo las catalogue.
    calificados_fase_c_C = df.loc[df['calificacion'] == 'C'] # Líneas para regresar a la fase C y que el humano las catalogue.
    calificados_fase_c_D = df.loc[df['calificacion'] == 'D'] # Líneas para que el algoritmo fase D (final) las catalogue.
    calificados_fase_c_E = df.loc[df['calificacion'] == 'E'] # Líneas para eliminar, la observación tiene el por qué.


    return calificados_fase_c_OK, calificados_fase_c_B, calificados_fase_c_C, calificados_fase_c_D, calificados_fase_c_E

In [10]:
def repetidos_match_1ro_df_from_excel(mes:int) -> list[pd.DataFrame]:

    file_name = f'{mes}_costo_ventas.xlsx'
    file_sheet = 'repetidos_match_1ro'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    return df

In [11]:
def api_call_purchase_doc_func(api_params: dict, search_costo_ventas: list[str] ) -> list[int, dict]:
    
    api_db = api_params['api_db']
    api_clave = api_params['api_clave']
    uid = api_params['api_uid']
    models = api_params['api_models']

    purchase_doc_fields = [
                    'name',
                    'state',
                    'partner_id',
                    'partner_ref',
                    'date_approve',
                    'x_fecha_factura',
                    'user_id',
                    'create_uid'
                    ]

    purchase_doc_ids = models.execute_kw(api_db, uid, api_clave, 'purchase.order', 'search', [search_costo_ventas])
    purchase_doc_json = models.execute_kw(api_db, uid, api_clave, 'purchase.order', 'read', [purchase_doc_ids], {'fields': purchase_doc_fields})
    
    return purchase_doc_ids, purchase_doc_json

In [12]:
def purchase_doc_func(purchase_doc_json: list[dict], prov_oficiales:pd.DataFrame) -> pd.DataFrame:

    purchase_doc_data = []

    for compra in purchase_doc_json:
        new = {}
        new['order_id'] = compra['id']
        new['order_name'] = compra['name']
        new['order_state'] = compra['state']
        new['order_date'] = compra['date_approve'] if compra['date_approve'] else pd.NA
        new['partner_id'] = compra['partner_id'][0]
        new['partner_name'] = compra['partner_id'][1]
        new['partner_fact_ref'] = compra['partner_ref']
        new['partner_fact_date'] = compra['x_fecha_factura'] if compra['x_fecha_factura'] else pd.NA
        new['capturista'] = compra['create_uid'][1] if compra['create_uid'] else pd.NA
        new['vendedora'] = compra['user_id'][1] if compra['user_id'] else pd.NA

        purchase_doc_data.append(new)

    compras_doc = pd.DataFrame(purchase_doc_data)
    compras_doc['order_date'] = pd.to_datetime(compras_doc['order_date'], format='%Y-%m-%d %H:%M:%S')
    compras_doc['partner_fact_date'] = pd.to_datetime(compras_doc['partner_fact_date'], format='%Y-%m-%d')
    compras_doc['oficial'] = compras_doc['partner_id'].isin(prov_oficiales['partner_id'])

    return compras_doc

In [13]:
def api_call_purchase_line_func(api_params: dict, purchase_doc_ids: list[int]) -> list[dict]:
    
    api_db = api_params['api_db']
    api_clave = api_params['api_clave']
    uid = api_params['api_uid']
    models = api_params['api_models']

    purchase_line_fields = [
                        'order_id',
                        'date_approve',
                        'partner_id',
                        'product_id',
                        'product_qty',
                        'price_unit_discounted'
                        ]

    purchase_line_ids = models.execute_kw(api_db, uid, api_clave, 'purchase.order.line', 'search', [[("order_id.id", "in", purchase_doc_ids)]])
    purchase_line_json = models.execute_kw(api_db, uid, api_clave, 'purchase.order.line', 'read', [purchase_line_ids], {'fields': purchase_line_fields})
    
    return purchase_line_json

In [14]:
def purchase_line_func(purchase_line_json: list[dict]) -> pd.DataFrame:
    
    purchase_line_data = []

    for line in purchase_line_json:
        new = {}
        new['line_id'] = line['id']
        new['order_id'] = line['order_id'][0]
        new['order_name'] = line['order_id'][1]
        new['order_date'] = line['date_approve'] if line['date_approve'] else pd.NA
        new['partner_id'] = line['partner_id'][0]
        new['partner_name'] = line['partner_id'][1]
        new['product_id_pp'] = line['product_id'][0]
        new['product_name'] = line['product_id'][1]
        new['product_qty'] = line['product_qty']
        new['product_cost'] = line['price_unit_discounted']
        
        purchase_line_data.append(new)

    compras_line = pd.DataFrame(purchase_line_data)
    compras_line['order_date'] = pd.to_datetime(compras_line['order_date'], format='%Y-%m-%d %H:%M:%S')

    return compras_line

In [15]:
def compras_func(compras_doc:pd.DataFrame, compras_line:pd.DataFrame, ultimo_costo:pd.DataFrame) -> pd.DataFrame:
    
    compras_odoo = pd.merge(
                    compras_line,
                    compras_doc[['order_id', 'partner_fact_ref', 'partner_fact_date', 'capturista', 'vendedora']], 
                    how='left', 
                    on='order_id'
                )

    compras_odoo['order_date'] = compras_odoo['order_date'].dt.normalize()

    cols_to_Int64 = ['line_id', 'order_id', 'partner_id', 'product_id_pp']
    compras_odoo[cols_to_Int64] = compras_odoo[cols_to_Int64].astype('Int64')

    compras_odoo['product_qty'] = compras_odoo['product_qty'].astype('Float64')
    compras_odoo['vendedora'] = compras_odoo['vendedora'].convert_dtypes()

    compras = pd.concat([compras_odoo, ultimo_costo])

    return compras, compras_odoo

# Pruebas

In [16]:
mes = 1

api_params = api_params_func()
search_costo_ventas = search_costo_ventas_func(mes, tolerance=[0,0])
mes_to_string = mes_to_string_func(mes)

ventas, ultimo_costo = get_dfs_from_database('local', mes_to_string)

prov_oficiales, prov_locales = prov_locales_df_from_excel()

if not ultimo_costo:
    ultimo_costo = ultimo_costo_sae_df_from_excel()
calificados_fase_c_OK, calificados_fase_c_B, calificados_fase_c_C, calificados_fase_c_D, calificados_fase_c_E = calificados_fase_c_df_from_excel()

purchase_doc_ids, purchase_doc_json = api_call_purchase_doc_func(api_params, search_costo_ventas)
purchase_line_json = api_call_purchase_line_func(api_params, purchase_doc_ids)

compras_doc = purchase_doc_func(purchase_doc_json, prov_oficiales)
compras_line = purchase_line_func(purchase_line_json)
compras, compras_odoo = compras_func(compras_doc, compras_line, ultimo_costo)

# Checks

In [17]:
# Línea para comprobrar que el 100% de los proveedores de Odoo están calificados en la lista de proveedores oficiales

check1 = (compras_doc[~compras_doc['partner_id'].isin(pd.concat([prov_locales, prov_oficiales])['partner_id'])]).drop_duplicates('partner_id')

if not check1.empty:
    print('Hay proveedores no calificados')
    display(check1)

else:
    print('Todo correcto con check1')

Todo correcto con check1

In [18]:
from IPython.display import display

check_costo_venta = (
    pd.merge_asof(
        left = ventas.sort_values('invoice_date'),
        right = compras.sort_values('order_date'), 
        
        left_by = 'product_id', 
        right_by = 'product_id_pp', 
        
        left_on = 'invoice_date', 
        right_on = 'order_date', 

        direction = 'backward')
)

check2 = check_costo_venta[check_costo_venta['product_cost'].isna()][['product_id', 'product_name_x']]

print(f'Hay {len(check2)} renglones sin costo de la venta.')

if not check2.empty:
    print('Los productos sin costo son los siguientes:')
    display(check2.drop_duplicates('product_id'))

else:
    print('Todo correcto con check2')

Hay 0 renglones sin costo de la venta.
Todo correcto con check2

# Desarrollo del código

In [19]:
cols_vent = ['fact_doc_id',
 'name',
 'invoice_date',
 'fact_line_id',
 'quantity',
 'price_unit',
 'salesperson_name',
 'product_id',
 'product_name']

In [20]:
repetidos_match_1ro = repetidos_match_1ro_df_from_excel(mes)


lista_capturistas = [
       'Elsa Ivette Diaz Leyva',
       'Alexa Yadira Mazariegos Zunun',
       'Dulce Guadalupe Pedroza Valenzuela',
       'Mariana Araceli Carvajal Flores',
       'Rosario Martinez Zarate'
]

compras_especiales = compras_odoo.loc[
            ~compras_odoo['vendedora'].isin(lista_capturistas)
            ]

compras_especiales_restantes = compras_especiales.loc[
            ~compras_especiales['line_id'].isin(repetidos_match_1ro['line_id'])
            ]

ventas_restantes = ventas.loc[
            ~ventas['fact_line_id'].isin(repetidos_match_1ro['fact_line_id'])
            ]

In [79]:
match_1_merge = (
    pd.merge_asof(
        left = compras_especiales_restantes.sort_values('order_date'), 
        right = ventas_restantes.sort_values('invoice_date'),
        
        left_by = ['product_id_pp', 'vendedora', 'product_qty'], 
        right_by = ['product_id', 'salesperson_name', 'quantity'], 
        
        left_on = 'order_date', 
        right_on = 'invoice_date', 

        direction = 'nearest',
        tolerance = pd.Timedelta(days=3))
)

In [80]:
ids_fact_line_repetidas = match_1_merge.loc[(~match_1_merge['fact_line_id'].isna()) & (match_1_merge['fact_line_id'].duplicated()), 'fact_line_id']

if not ids_fact_line_repetidas.empty:

    cols = [
        'line_id', 'fact_line_id', '.',
        'order_name', 'order_date', 'partner_name_x', 'partner_fact_ref', 'partner_fact_date',  'product_qty',
        'product_cost', 'vendedora', 'product_id_pp', 'product_name_x', '.',
        'fact_doc_id', 'name', 'invoice_date', 'partner_name_y', 'quantity', 'salesperson_name', 'price_unit', 'discount',]


    
    repetidos_match_1ro_por_corregir = match_1_merge.loc[match_1_merge['fact_line_id'].isin(ids_fact_line_repetidas)].reset_index()
    repetidos_match_1ro_por_corregir.loc[:,'.'] = pd.NA

    archivo = 'repetidos_match_1ro_por_corregir.xlsx'
    desktop_path = Path.home().joinpath(f'Desktop/{archivo}')
    repetidos_match_1ro_por_corregir[cols].to_excel(desktop_path)
    print(f'¡Alto! tienes "fact_line_id" repetidas. \nSe generó un archivo excel en tu escritorio llamado "{archivo}" para que corrijas la información.')

else:
    print('No hay ningún "fact_line_id" repetido en el primer match. Puedes continuar...')

No hay ningún "fact_line_id" repetido en el primer match. Puedes continuar...

In [81]:
# Match resultantes del 1er match.
match_1 = match_1_merge.loc[~match_1_merge['fact_line_id'].isna(), ['line_id', 'fact_line_id']]

# Después de correr el 1er match, las ventas restantes
ventas_restantes_after_match_1 = ventas_restantes.loc[
                                        ~ventas_restantes['fact_line_id'].isin(match_1['fact_line_id'])
                                    ]

# Después de correr el 1er match, las compras que tienen un product_id que sí existe en las ventas restantes.
compras_especiales_restantes_after_match_1 = compras_especiales_restantes.loc[
                                                        (~compras_especiales_restantes['line_id'].isin(match_1['line_id']))
                                                        & (compras_especiales_restantes['product_id_pp'].isin(ventas_restantes_after_match_1['product_id']))
                                                    ]

# Resto de las compras especiales. Estan no tienen un product_id que existe en las ventas restantes y no se pueden merchar.
compras_especiales_sin_ventas = compras_especiales_restantes.loc[
                                                        (~compras_especiales_restantes['line_id'].isin(match_1['line_id']))
                                                        & (~compras_especiales_restantes['product_id_pp'].isin(ventas_restantes_after_match_1['product_id']))
                                                    ]

In [75]:
match_2 = pd.DataFrame([], columns=['line_id','fact_line_id'])

for i in range(len(compras_especiales_restantes_after_match_1)):
    
    linea_compra = compras_especiales_restantes_after_match_1.sort_values('order_date').iloc[i]

    mini_df = ventas_restantes_after_match_1.loc[
                (~ventas_restantes_after_match_1['fact_line_id'].isin(match_2['fact_line_id']))
                & (ventas_restantes_after_match_1['salesperson_name'] == linea_compra['vendedora'])
                & (ventas_restantes_after_match_1['product_id'] == linea_compra['product_id_pp'])
                # & (ventas_restantes_after_match_1['invoice_date'] >= linea_compra['order_date'] - pd.Timedelta(days=5))
                # & (ventas_restantes_after_match_1['invoice_date'] <= linea_compra['order_date'] + pd.Timedelta(days=5))
            ]
    
    if not mini_df.empty:
        df_copia = mini_df.copy()
        df_copia['diff'] = abs(df_copia['invoice_date'] - linea_compra['order_date'])
        df_sort = df_copia.sort_values('diff').reset_index()
        df_sort['cumsum'] = df_sort['quantity'].cumsum()
        index = df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index[0] if not df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index.empty else None
        if index != None:
            df_sort.loc[:index , 'line_id'] = linea_compra['line_id']

            if match_2.empty:
                match_2 = df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']].copy()
            else:
                match_2 = pd.concat([
                            match_2, 
                            df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']],
                        ])
            
        else:    
            df_sort.loc[:index , 'line_id'] = pd.NA


        print(f"    ---> Código a explorar {linea_compra['product_id_pp']}")
        display(compras_especiales_restantes_after_match_1[compras_especiales_restantes_after_match_1['line_id'] == linea_compra['line_id']])
        print(f"-> Cantidad {linea_compra['product_qty']}")
        display(df_sort[cols_vent + ['diff', 'cumsum', 'line_id']])
        print(index)
        print('\n\n')

    ---> Código a explorar 13371

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1666,5,2,P00002 (SJCFCO 23),2024-01-03,5326,Madereria El Pino De Los Cabos,13371,[12749] Triplay Pino 1/4 4'*8' 1/Cara *12749*,10.0,267.25,SJCFCO 23,NaT,<NA>,Yamilet Blanco Salas

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,2994,F2-VS/2024/00024,2024-01-08,11002,10.0,390.0,Yamilet Blanco Salas,13371,Triplay Pino 1/4 4'*8' 1/Cara *12749*,5 days,10.0,5.0

0



    ---> Código a explorar 14863

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1611,60,45,P00038 (FH 9600),2024-01-03,5153,Grupo Ferreteria Calzada,14863,"[1380] Broca Punta De Carburo TungSTeno 3/16"" ...",5.0,160.0,FH 9600,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5984,F1-VS/2024/00154,2024-01-12,21925,5.0,210.0,Irma Carvajal Flores,14863,"Broca Punta De Carburo TungSTeno 3/16"" *1380*",9 days,5.0,60.0

0



    ---> Código a explorar 10856

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1612,58,44,P00037 (C 259720),2024-01-03,5321,El Gran Tlapalero,10856,[528] Tope Ph Media Luna #54-C #1464 *528*,50.0,53.93,C 259720,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 50.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1579,F1-VS/2024/00028,2024-01-05,5801,125.0,81.36,Irma Carvajal Flores,10856,Tope Ph Media Luna #54-C #1464 *528*,2 days,125.0,<NA>
1,3911,F1-VS/2024/00095,2024-01-09,14241,100.0,81.36,Irma Carvajal Flores,10856,Tope Ph Media Luna #54-C #1464 *528*,6 days,225.0,<NA>

None



    ---> Código a explorar 14773

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1617,54,40,P00033 (2000005232684875),2024-01-03,5128,Mercado Libre,14773,[1375] Disco Abrasivo Desbaste Metal 4-1/2x7/8...,25.0,25.14,2000005232684875,NaT,<NA>,Yolanda Alejandra Rodriguez González

-> Cantidad 25.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1374,F2-CC/2024/00177,2024-01-05,5084,20.0,71.5,Yolanda Alejandra Rodriguez González,14773,Disco Abrasivo Desbaste Metal 4-1/2x7/8 B-4426...,2 days,20.0,<NA>

None



    ---> Código a explorar 14793

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1616,55,41,P00034 (2000005206682675),2024-01-03,5128,Mercado Libre,14793,[1184] Sierra De Poda 30Cm Husqvarna 510192104...,2.0,688.8,2000005206682675,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5539,F1-VS/2024/00143,2024-01-12,20336,2.0,1046.0,Irma Carvajal Flores,14793,Sierra De Poda 30Cm Husqvarna 510192104 *1184*,9 days,2.0,55.0

0



    ---> Código a explorar 14861

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1613,59,44,P00037 (C 259720),2024-01-03,5321,El Gran Tlapalero,14861,[55960] Bisagra De Piso Ph #1500 2085 Cromo Sa...,12.0,345.52,C 259720,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3235,F1-VS/2024/00061,2024-01-08,11883,12.0,560.0,Irma Carvajal Flores,14861,Bisagra De Piso Ph #1500 2085 Cromo Satin Pz *...,5 days,12.0,59.0

0



    ---> Código a explorar 14862

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1607,65,50,P00043 (100104946),2024-01-04,5173,Casper Ventas Y Representaciones,14862,[13884] Cemento Blanco (50 Kilos) *13884*,4.0,418.03,100104946,NaT,<NA>,Yamilet Blanco Salas

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3086,F2-VS/2024/00029,2024-01-08,11303,4.0,627.05,Yamilet Blanco Salas,14862,Cemento Blanco (50 Kilos) *13884*,4 days,4.0,65.0

0



    ---> Código a explorar 28352

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1606,71,53,P00046 (BLEVIFA 14770),2024-01-04,5174,Campos Reyeros Y Cia,28352,[6521] Catalizador PolyForm 1Lt *6521*,2.0,538.36,BLEVIFA 14770,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8415,F1-VS/2024/00202,2024-01-17,31118,2.0,818.3,Mayra Angelica Parada Manjarrez,28352,Catalizador PolyForm 1Lt *6521*,13 days,2.0,71.0

0



    ---> Código a explorar 14371

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1610,61,47,P00040 (4HGFFI 172807),2024-01-04,5387,Home Depot Mexico,14371,"[19897] Lijadora orb. 5"" Dewalt Dwe6421-B3 *19...",2.0,1525.0,4HGFFI 172807,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5121,F1-VS/2024/00128,2024-01-11,18821,2.0,2287.0,Mayra Angelica Parada Manjarrez,14371,"Lijadora orb. 5"" Dewalt Dwe6421-B3 *19897*",7 days,2.0,61.0

0



    ---> Código a explorar 12774

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1577,100,65,P00058 (BSJOSFA 286261),2024-01-05,5174,Campos Reyeros Y Cia,12774,[10992] Papel Verde 18*60 YDS TOT12218 Trimaco...,15.0,166.38,BSJOSFA 286261,NaT,Elsa Ivette Diaz Leyva,Karla Jaqueline Rivera Hernández

-> Cantidad 15.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,995,F2-CC/2024/00121,2024-01-04,3639,5.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,1 days,5.0,<NA>
1,4276,F2-CC/2024/00557,2024-01-10,15555,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,5 days,6.0,<NA>
2,7315,F2-CC/2024/00921,2024-01-16,27024,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,11 days,7.0,<NA>
3,8551,F2-CC/2024/01105,2024-01-17,31630,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,12 days,8.0,<NA>
4,8944,F2-CC/2024/01147,2024-01-18,33301,5.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,13 days,13.0,<NA>
5,12698,F2-CC/2024/01632,2024-01-25,47816,6.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*,20 days,19.0,<NA>

None



    ---> Código a explorar 28368

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1557,122,82,P00071 (2000005206736429),2024-01-06,5128,Mercado Libre,28368,[1397] Bolsa Para Polvo N409756 P/lijadora Dwe...,2.0,255.17,2000005206736429,NaT,Gretel Gómez Alcázar,Brenda Luz Acosta Lopez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5882,F2-VS/2024/00088,2024-01-12,21580,2.0,402.0,Brenda Luz Acosta Lopez,28368,Bolsa Para Polvo N409756 P/lijadora Dwe6421-b3...,6 days,2.0,122.0

0



    ---> Código a explorar 26743

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1539,141,93,P00082 (C 259178),2024-01-08,5321,El Gran Tlapalero,26743,[55866] Chapa Soprano 30mm Standar G C J1031 *...,40.0,40.07,C 259178,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 40.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,2348,F2-VS/2024/00008,2024-01-06,8622,21.0,88.41,Brenda Luz Acosta Lopez,26743,Chapa Soprano 30mm Standar G C J1031 *55866*,2 days,21.0,<NA>

None



    ---> Código a explorar 27184

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1542,139,92,P00081 (C 259719),2024-01-08,5321,El Gran Tlapalero,27184,[25631] Carret. P/Riel Corre 2181300NI Pz *25631*,10.0,15.5,C 259719,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8850,F2-VS/2024/00132,2024-01-18,32956,10.0,29.0,Brenda Luz Acosta Lopez,27184,Carret. P/Riel Corre 2181300NI Pz *25631*,10 days,10.0,139.0

0



    ---> Código a explorar 13552

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1545,135,91,P00080 (C 259462),2024-01-08,5321,El Gran Tlapalero,13552,[2489] Chapa Ph P/Perfil Alum #550-AN #585 CE ...,5.0,327.47,C 259462,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9853,F2-VS/2024/00149,2024-01-19,36574,4.0,530.92,Brenda Luz Acosta Lopez,13552,Chapa Ph P/Perfil Alum #550-AN #585 CE *2489*,11 days,4.0,<NA>

None



    ---> Código a explorar 12446

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1550,130,88,P00077 (IWAYYB 12428),2024-01-08,5281,Nueva Wal Mart De Mexico,12446,[10695] Brasso Liquido 200mls *10695*,8.0,151.72,IWAYYB 12428,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 8.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3376,F1-VS/2024/00078,2024-01-08,12386,20.0,230.0,Irma Carvajal Flores,12446,Brasso Liquido 200mls *10695*,0 days,20.0,<NA>

None



    ---> Código a explorar 12446

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1551,129,87,P00076 (IWAJY 697677),2024-01-08,5281,Nueva Wal Mart De Mexico,12446,[10695] Brasso Liquido 200mls *10695*,12.0,151.72,IWAJY 697677,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3376,F1-VS/2024/00078,2024-01-08,12386,20.0,230.0,Irma Carvajal Flores,12446,Brasso Liquido 200mls *10695*,0 days,20.0,<NA>

None



    ---> Código a explorar 12755

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1575,103,67,P00060 (A 10767768),2024-01-08,5178,Sayer Lack Mexicana,12755,[14444] Tinta Hidro Sayer TH-8029 (1Lt) Chocol...,52.0,163.59,A 10767768,NaT,Elsa Ivette Diaz Leyva,Yamilet Blanco Salas

-> Cantidad 52.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3109,F2-VS/2024/00030,2024-01-08,11390,17.0,285.39,Yamilet Blanco Salas,12755,Tinta Hidro Sayer TH-8029 (1Lt) Chocolat *14444*,0 days,17.0,<NA>
1,5143,F2-VS/2024/00076,2024-01-11,18898,8.0,285.39,Yamilet Blanco Salas,12755,Tinta Hidro Sayer TH-8029 (1Lt) Chocolat *14444*,3 days,25.0,<NA>

None



    ---> Código a explorar 13811

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1549,132,89,P00078 (B 83278),2024-01-08,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,5.0,443.34,B 83278,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,2498,F1-VS/2024/00038,2024-01-06,9124,3.0,721.0,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,2 days,3.0,<NA>
1,1156,F1-VS/2024/00015,2024-01-04,4210,6.0,750.9,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,4 days,9.0,<NA>

None



    ---> Código a explorar 14147

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1477,205,119,P00108 (MPIFCO 423),2024-01-09,5296,Madereria Pichonchas,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,6.0,646.55,MPIFCO 423,NaT,Elsa Ivette Diaz Leyva,Irma Carvajal Flores

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3378,F1-VS/2024/00080,2024-01-08,12394,3.0,969.82,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,1 days,3.0,205.0
1,3378,F1-VS/2024/00080,2024-01-08,12398,3.0,969.82,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,1 days,6.0,205.0
2,8417,F1-VS/2024/00203,2024-01-17,31128,4.0,905.0,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,8 days,10.0,NaN

1



    ---> Código a explorar 28364

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1484,198,113,P00102 (XA 21546),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,28364,[1392] Tornillo Hexagonal Bronce 1/4 x 2 1/2 *...,200.0,17.5,XA 21546,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 200.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3872,F1-VS/2024/00090,2024-01-09,14104,100.0,26.6,Irma Carvajal Flores,28364,Tornillo Hexagonal Bronce 1/4 x 2 1/2 *1392*,0 days,100.0,198.0
1,3880,F1-VS/2024/00092,2024-01-09,14131,100.0,26.6,Irma Carvajal Flores,28364,Tornillo Hexagonal Bronce 1/4 x 2 1/2 *1392*,0 days,200.0,198.0

1



    ---> Código a explorar 28365

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1485,199,113,P00102 (XA 21546),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,28365,[1393] Tornillo Hexagonal Bronce 1/4 x 2 *1393*,700.0,12.22,XA 21546,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 700.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3872,F1-VS/2024/00090,2024-01-09,14105,200.0,18.4,Irma Carvajal Flores,28365,Tornillo Hexagonal Bronce 1/4 x 2 *1393*,0 days,200.0,199.0
1,3876,F1-VS/2024/00091,2024-01-09,14119,300.0,18.4,Irma Carvajal Flores,28365,Tornillo Hexagonal Bronce 1/4 x 2 *1393*,0 days,500.0,199.0
2,3880,F1-VS/2024/00092,2024-01-09,14132,200.0,18.4,Irma Carvajal Flores,28365,Tornillo Hexagonal Bronce 1/4 x 2 *1393*,0 days,700.0,199.0

2



    ---> Código a explorar 7481

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1486,197,112,P00101 (WA 12776),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7481,[2540] Rondana Plana 3/16 C#184 *2540*,200.0,0.16,WA 12776,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 200.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3191,F1-VS/2024/00058,2024-01-08,11732,2800.0,0.34,Irma Carvajal Flores,7481,Rondana Plana 3/16 C#184 *2540*,1 days,2800.0,<NA>

None



    ---> Código a explorar 7856

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1490,196,111,P00100 (XA 21547),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7856,"[5244] Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *...",150.0,1.3,XA 21547,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 150.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3191,F1-VS/2024/00058,2024-01-08,11734,250.0,3.6,Irma Carvajal Flores,7856,"Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *5244*",1 days,250.0,<NA>

None



    ---> Código a explorar 7481

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1488,194,111,P00100 (XA 21547),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7481,[2540] Rondana Plana 3/16 C#184 *2540*,800.0,0.17,XA 21547,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 800.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3191,F1-VS/2024/00058,2024-01-08,11732,2800.0,0.34,Irma Carvajal Flores,7481,Rondana Plana 3/16 C#184 *2540*,1 days,2800.0,<NA>

None



    ---> Código a explorar 13371

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1512,166,107,P00096 (B 83302),2024-01-09,5290,Maria Reyna Navarrete Cortez,13371,[12749] Triplay Pino 1/4 4'*8' 1/Cara *12749*,9.0,272.87,B 83302,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 9.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3378,F1-VS/2024/00080,2024-01-08,12397,5.0,409.31,Irma Carvajal Flores,13371,Triplay Pino 1/4 4'*8' 1/Cara *12749*,1 days,5.0,166.0
1,2874,F1-VS/2024/00047,2024-01-06,10434,4.0,409.31,Irma Carvajal Flores,13371,Triplay Pino 1/4 4'*8' 1/Cara *12749*,3 days,9.0,166.0
2,5978,F1-VS/2024/00153,2024-01-12,21902,2.0,409.31,Irma Carvajal Flores,13371,Triplay Pino 1/4 4'*8' 1/Cara *12749*,3 days,11.0,NaN

1



    ---> Código a explorar 28370

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1518,163,105,P00094 (A 6354),2024-01-09,5269,Proveedora De Pisos Y Sanitarios De Los Cabos,28370,[1401] Boquilla S/Arena Negro*1401*,2.0,142.24,A 6354,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3396,F1-VS/2024/00085,2024-01-08,12462,3.0,234.0,Irma Carvajal Flores,28370,Boquilla S/Arena Negro*1401*,1 days,3.0,<NA>

None



    ---> Código a explorar 28370

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1523,162,104,P00093 (E 46983),2024-01-09,5269,Proveedora De Pisos Y Sanitarios De Los Cabos,28370,[1401] Boquilla S/Arena Negro*1401*,1.0,130.17,E 46983,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3396,F1-VS/2024/00085,2024-01-08,12462,3.0,234.0,Irma Carvajal Flores,28370,Boquilla S/Arena Negro*1401*,1 days,3.0,<NA>

None



    ---> Código a explorar 28382

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1531,148,99,P00088 (FACSL 306857),2024-01-09,5351,El Arco Csl,28382,"[1421] Valvula BCE B RSC 3/4"" *1421*",2.0,126.72,FACSL 306857,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12179,F1-VS/2024/00302,2024-01-24,45449,1.0,195.0,Irma Carvajal Flores,28382,"Valvula BCE B RSC 3/4"" *1421*",15 days,1.0,<NA>

None



    ---> Código a explorar 28381

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1532,149,99,P00088 (FACSL 306857),2024-01-09,5351,El Arco Csl,28381,"[1420] Valvula BCE B RSC 1/2"" *1420*",1.0,82.76,FACSL 306857,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12179,F1-VS/2024/00302,2024-01-24,45450,1.0,132.0,Irma Carvajal Flores,28381,"Valvula BCE B RSC 1/2"" *1420*",15 days,1.0,149.0

0



    ---> Código a explorar 13331

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1437,245,139,P00128 (B 83329),2024-01-10,5290,Maria Reyna Navarrete Cortez,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,6.0,261.09,B 83329,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13045,F1-VS/2024/00316,2024-01-25,48950,6.0,402.0,Irma Carvajal Flores,13331,Triplay Birch 1/4 4'*8' *16320*,15 days,6.0,245.0

0



    ---> Código a explorar 13811

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1438,246,139,P00128 (B 83329),2024-01-10,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,4.0,443.34,B 83329,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3920,F1-VS/2024/00097,2024-01-09,14278,6.0,673.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,1 days,6.0,<NA>
1,5977,F1-VS/2024/00152,2024-01-12,21898,2.0,720.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,2 days,8.0,<NA>
2,8003,F1-VS/2024/00191,2024-01-17,29659,20.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,7 days,28.0,<NA>
3,8417,F1-VS/2024/00203,2024-01-17,31127,4.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,7 days,32.0,<NA>
4,9727,F1-VS/2024/00244,2024-01-19,36164,18.0,625.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,9 days,50.0,<NA>

None



    ---> Código a explorar 14769

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1439,244,138,P00127 (WAI 53269),2024-01-10,5175,Cia Sherwin Williams,14769,[41555] Kem-Tone Base Deep Mate SW-7019 *41555*,3.0,1818.95,WAI 53269,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,2467,F1-VS/2024/00036,2024-01-06,9007,1.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*,4 days,1.0,<NA>
1,8894,F1-VS/2024/00222,2024-01-18,33114,3.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*,8 days,4.0,<NA>
2,15421,F1-VS/2024/00345,2024-01-30,58250,3.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*,20 days,7.0,<NA>

None



    ---> Código a explorar 26810

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1446,236,134,P00123 (AZG 3298252),2024-01-10,5266,Costco De Mexico,26810,[47501] Paquete Pilas AA (40 pz) Duracell *47501*,2.0,322.63,AZG 3298252,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6746,F2-VS/2024/00104,2024-01-15,24974,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,5 days,4.0,<NA>
1,6747,F2-VS/2024/00105,2024-01-15,24977,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,5 days,8.0,<NA>

None



    ---> Código a explorar 13331

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1451,229,130,P00119 (B 83327),2024-01-10,5290,Maria Reyna Navarrete Cortez,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,3.0,261.09,B 83327,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4106,F1-VS/2024/00103,2024-01-10,14950,1.0,489.66,Mayra Angelica Parada Manjarrez,13331,Triplay Birch 1/4 4'*8' *16320*,0 days,1.0,229.0
1,3919,F1-VS/2024/00096,2024-01-09,14273,2.0,489.8,Mayra Angelica Parada Manjarrez,13331,Triplay Birch 1/4 4'*8' *16320*,1 days,3.0,229.0
2,10208,F1-VS/2024/00258,2024-01-20,38052,8.0,489.66,Mayra Angelica Parada Manjarrez,13331,Triplay Birch 1/4 4'*8' *16320*,10 days,11.0,NaN

1



    ---> Código a explorar 14287

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1461,222,127,P00116 (MPIFCO 462),2024-01-10,5296,Madereria Pichonchas,14287,[5211] Tabla Alder 1*8 (Cama) *5211*,3.0,965.52,MPIFCO 462,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4106,F1-VS/2024/00103,2024-01-10,14956,1.0,2363.6,Mayra Angelica Parada Manjarrez,14287,Tabla Alder 1*8 (Cama) *5211*,0 days,1.0,222.0
1,4578,F1-VS/2024/00119,2024-01-10,16663,1.0,2363.8,Mayra Angelica Parada Manjarrez,14287,Tabla Alder 1*8 (Cama) *5211*,0 days,2.0,222.0
2,3919,F1-VS/2024/00096,2024-01-09,14272,1.0,2363.8,Mayra Angelica Parada Manjarrez,14287,Tabla Alder 1*8 (Cama) *5211*,1 days,3.0,222.0
3,10208,F1-VS/2024/00258,2024-01-20,38053,2.0,2363.8,Mayra Angelica Parada Manjarrez,14287,Tabla Alder 1*8 (Cama) *5211*,10 days,5.0,NaN

2



    ---> Código a explorar 14772

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1462,223,127,P00116 (MPIFCO 462),2024-01-10,5296,Madereria Pichonchas,14772,[16313] Pegamento Titebond Verde1L *16313*,4.0,245.69,MPIFCO 462,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4106,F1-VS/2024/00103,2024-01-10,14954,1.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,0 days,1.0,223.0
1,4578,F1-VS/2024/00119,2024-01-10,16671,2.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,0 days,3.0,223.0
2,3919,F1-VS/2024/00096,2024-01-09,14274,1.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,1 days,4.0,223.0
3,6361,F1-VS/2024/00159,2024-01-13,23492,3.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,3 days,7.0,NaN
4,10208,F1-VS/2024/00258,2024-01-20,38055,2.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,10 days,9.0,NaN

2



    ---> Código a explorar 26810

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1448,235,133,P00122 (AZG 3298248),2024-01-10,5266,Costco De Mexico,26810,[47501] Paquete Pilas AA (40 pz) Duracell *47501*,1.0,322.63,AZG 3298248,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6746,F2-VS/2024/00104,2024-01-15,24974,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,5 days,4.0,<NA>
1,6747,F2-VS/2024/00105,2024-01-15,24977,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,5 days,8.0,<NA>

None



    ---> Código a explorar 28413

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1289,407,169,P00158 (WAI 53236),2024-01-11,5175,Cia Sherwin Williams,28413,[1498] Pintura Kem-Tone Extra White Mate Bajo ...,1.0,2182.76,WAI 53236,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58242,1.0,3274.14,Irma Carvajal Flores,28413,Pintura Kem-Tone Extra White Mate Bajo SW7102 ...,19 days,1.0,407.0

0



    ---> Código a explorar 14374

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1292,401,165,P00154 (MPIFCO 626),2024-01-11,5296,Madereria Pichonchas,14374,"[5902] TABLA DE ALDER 1"" CAMA *5902*",25.0,1206.9,MPIFCO 626,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 25.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5144,F1-VS/2024/00130,2024-01-11,18901,5.0,2363.9,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*",0 days,5.0,401.0
1,5152,F1-VS/2024/00131,2024-01-11,18929,10.0,2363.9,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*",0 days,15.0,401.0
2,5155,F1-VS/2024/00134,2024-01-11,18939,5.0,2363.9,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*",0 days,20.0,401.0
3,5158,F1-VS/2024/00136,2024-01-11,18951,5.0,2363.9,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*",0 days,25.0,401.0
4,6361,F1-VS/2024/00159,2024-01-13,23483,4.0,2363.8,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*",2 days,29.0,NaN

3



    ---> Código a explorar 14841

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1299,394,163,P00152 (36623),2024-01-11,5378,Maderas Dimar,14841,[71335] Bisagra Recta Cierre Lento #315.07.023...,3.0,100.45,36623,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1165,F1-VS/2024/00016,2024-01-04,4253,15.0,174.68,Mayra Angelica Parada Manjarrez,14841,Bisagra Recta Cierre Lento #315.07.023 *71335*,7 days,15.0,<NA>

None



    ---> Código a explorar 14201

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1304,390,159,P00148 (F 302124),2024-01-11,5262,Chapas Y Maderas Importadas,14201,[27002] Bisagra Tectus 240 3D Gris #274.100 (P...,10.0,757.12,F 302124,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15427,F2-VS/2024/00214,2024-01-30,58267,40.0,1275.14,Brenda Luz Acosta Lopez,14201,Bisagra Tectus 240 3D Gris #274.100 (Pz) *27002*,19 days,40.0,<NA>

None



    ---> Código a explorar 28117

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1307,386,156,P00145 (BLEVIFA 014889),2024-01-11,5174,Campos Reyeros Y Cia,28117,[16725] Thinner Americano 4 lts *16725*,4.0,303.45,BLEVIFA 014889,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5158,F1-VS/2024/00136,2024-01-11,18955,2.0,455.17,Mayra Angelica Parada Manjarrez,28117,Thinner Americano 4 lts *16725*,0 days,2.0,386.0
1,4578,F1-VS/2024/00119,2024-01-10,16669,2.0,455.18,Mayra Angelica Parada Manjarrez,28117,Thinner Americano 4 lts *16725*,1 days,4.0,386.0
2,10208,F1-VS/2024/00258,2024-01-20,38059,2.0,455.17,Mayra Angelica Parada Manjarrez,28117,Thinner Americano 4 lts *16725*,9 days,6.0,NaN

1



    ---> Código a explorar 14263

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1303,389,159,P00148 (F 302124),2024-01-11,5262,Chapas Y Maderas Importadas,14263,[55894] Bis. Tectus 340 3D 80Kg Negro *55894*,35.0,877.36,F 302124,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 35.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9845,F2-VS/2024/00148,2024-01-19,36551,35.0,1427.55,Brenda Luz Acosta Lopez,14263,Bis. Tectus 340 3D 80Kg Negro *55894*,8 days,35.0,389.0

0



    ---> Código a explorar 28391

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1373,310,144,P00133 (BSLUCFA 317715),2024-01-11,5174,Campos Reyeros Y Cia,28391,"[7683] Brocha Cerda Natural 3"" *7683*",87.0,19.83,BSLUCFA 317715,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 87.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4559,F1-VS/2024/00118,2024-01-10,16596,30.0,30.14,Mayra Angelica Parada Manjarrez,28391,"Brocha Cerda Natural 3"" *7683*",1 days,30.0,310.0
1,7351,F1-VS/2024/00172,2024-01-16,27178,57.0,30.14,Mayra Angelica Parada Manjarrez,28391,"Brocha Cerda Natural 3"" *7683*",5 days,87.0,310.0

1



    ---> Código a explorar 28390

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1372,309,144,P00133 (BSLUCFA 317715),2024-01-11,5174,Campos Reyeros Y Cia,28390,"[10702] Brocha Cerda Natural 2"" *10702*",73.0,13.36,BSLUCFA 317715,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 73.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4559,F1-VS/2024/00118,2024-01-10,16595,30.0,21.31,Mayra Angelica Parada Manjarrez,28390,"Brocha Cerda Natural 2"" *10702*",1 days,30.0,309.0
1,7351,F1-VS/2024/00172,2024-01-16,27177,43.0,21.31,Mayra Angelica Parada Manjarrez,28390,"Brocha Cerda Natural 2"" *10702*",5 days,73.0,309.0

1



    ---> Código a explorar 13842

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1285,411,173,P00162 (A 27753),2024-01-12,5241,Jose Leobardo Corrales Acosta,13842,[11143] Pistola P/Pintar Devilbis MGQ-500 *11143*,2.0,488.03,A 27753,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1475,F1-VS/2024/00021,2024-01-05,5431,1.0,749.79,Mayra Angelica Parada Manjarrez,13842,Pistola P/Pintar Devilbis MGQ-500 *11143*,7 days,1.0,<NA>

None



    ---> Código a explorar 14147

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1273,422,180,P00169 (B 83355),2024-01-12,5290,Maria Reyna Navarrete Cortez,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,6.0,544.44,B 83355,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5924,F1-VS/2024/00146,2024-01-12,21712,10.0,1330.6,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,0 days,10.0,<NA>
1,5112,F1-VS/2024/00126,2024-01-11,18778,2.0,1066.82,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,1 days,12.0,<NA>
2,5113,F1-VS/2024/00127,2024-01-11,18782,4.0,969.85,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,1 days,16.0,<NA>
3,8995,F1-VS/2024/00228,2024-01-18,33554,3.0,982.75,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,6 days,19.0,<NA>

None



    ---> Código a explorar 13638

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1169,529,187,P00176 (C 260333),2024-01-12,5321,El Gran Tlapalero,13638,[11816] Chapa Yale P/Entrada Ball Cm 80049 *11...,10.0,350.24,C 260333,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,4583,F2-VS/2024/00063,2024-01-10,16692,6.0,625.0,Brenda Luz Acosta Lopez,13638,Chapa Yale P/Entrada Ball Cm 80049 *11816*,2 days,6.0,<NA>

None



    ---> Código a explorar 7671

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1168,530,188,P00177 (WA 12838),2024-01-12,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7671,[3996] Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,1100.0,0.81,WA 12838,NaT,<NA>,Karla Jaqueline Rivera Hernández

-> Cantidad 1100.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5592,F2-CC/2024/00715,2024-01-12,20562,600.0,1.32,Karla Jaqueline Rivera Hernández,7671,Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,0 days,600.0,530.0
1,5592,F2-CC/2024/00715,2024-01-12,20586,300.0,1.32,Karla Jaqueline Rivera Hernández,7671,Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,0 days,900.0,530.0
2,5592,F2-CC/2024/00715,2024-01-12,20593,200.0,1.32,Karla Jaqueline Rivera Hernández,7671,Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,0 days,1100.0,530.0

2



    ---> Código a explorar 28263

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1167,531,189,P00178 (4HGFFI 176262),2024-01-12,5387,Home Depot Mexico,28263,[11273] Tope Anti-Impacto Redondo *11273*,5.0,56.04,4HGFFI 176262,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9853,F2-VS/2024/00149,2024-01-19,36584,5.0,78.0,Brenda Luz Acosta Lopez,28263,Tope Anti-Impacto Redondo *11273*,7 days,5.0,531.0

0



    ---> Código a explorar 13689

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1164,534,192,P00181 (3215),2024-01-12,5365,Raul Mosqueda Verdugo,13689,[78936] Pasta Española Marfil *78936*,18.0,387.94,3215,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 18.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12163,F1-VS/2024/00299,2024-01-24,45383,18.0,589.0,Irma Carvajal Flores,13689,Pasta Española Marfil *78936*,12 days,18.0,534.0
1,12410,F1-VS/2024/00312,2024-01-24,46316,6.0,581.91,Irma Carvajal Flores,13689,Pasta Española Marfil *78936*,12 days,24.0,NaN

0



    ---> Código a explorar 13943

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1152,543,198,P00187 (B 83392),2024-01-13,5290,Maria Reyna Navarrete Cortez,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,24.0,536.41,B 83392,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 24.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5924,F1-VS/2024/00146,2024-01-12,21711,20.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,1 days,20.0,543.0
1,5925,F1-VS/2024/00147,2024-01-12,21715,4.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,1 days,24.0,543.0
2,7668,F1-VS/2024/00184,2024-01-16,28301,16.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,3 days,40.0,NaN
3,7670,F1-VS/2024/00186,2024-01-16,28308,3.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,3 days,43.0,NaN
4,7671,F1-VS/2024/00187,2024-01-16,28312,2.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,3 days,45.0,NaN
5,7680,F1-VS/2024/00188,2024-01-16,28339,20.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,3 days,65.0,NaN
6,10208,F1-VS/2024/00258,2024-01-20,38061,2.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,7 days,67.0,NaN

1



    ---> Código a explorar 13811

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1154,545,198,P00187 (B 83392),2024-01-13,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,3.0,443.34,B 83392,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,2498,F1-VS/2024/00038,2024-01-06,9124,3.0,721.0,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,7 days,3.0,545.0
1,1156,F1-VS/2024/00015,2024-01-04,4210,6.0,750.9,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,9 days,9.0,NaN

0



    ---> Código a explorar 28117

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1159,539,196,P00185 (BLEVIFA 014922),2024-01-13,5174,Campos Reyeros Y Cia,28117,[16725] Thinner Americano 4 lts *16725*,4.0,303.45,BLEVIFA 014922,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10208,F1-VS/2024/00258,2024-01-20,38059,2.0,455.17,Mayra Angelica Parada Manjarrez,28117,Thinner Americano 4 lts *16725*,7 days,2.0,<NA>

None



    ---> Código a explorar 28429

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1124,576,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28429,[1533] Boquilla Ajustable de 4 Pies (1.2m) Con...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58246,1.0,55.0,Irma Carvajal Flores,28429,Boquilla Ajustable de 4 Pies (1.2m) Con Filtro...,15 days,1.0,<NA>

None



    ---> Código a explorar 28435

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1121,593,218,P00207 (4HGFFI 177069),2024-01-15,5387,Home Depot Mexico,28435,[1570] Juego De Llaves Torx Tipo Navaja Husky ...,1.0,219.83,4HGFFI 177069,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58249,1.0,350.0,Irma Carvajal Flores,28435,Juego De Llaves Torx Tipo Navaja Husky *1570*,15 days,1.0,593.0

0



    ---> Código a explorar 26798

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1122,579,217,P00206 (254SLSLCO93693),2024-01-15,5278,Comercabos,26798,[50214] Kronos Estructurado MC DONALDS 20*20 *...,3.0,197.41,254SLSLCO93693,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58244,3.0,320.0,Irma Carvajal Flores,26798,Kronos Estructurado MC DONALDS 20*20 *50214*,15 days,3.0,579.0

0



    ---> Código a explorar 28434

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1123,587,217,P00206 (254SLSLCO93693),2024-01-15,5278,Comercabos,28434,[1565] Astratto Blanco 20X30 P25 Primera *1565*,1.0,225.0,254SLSLCO93693,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58245,1.0,380.0,Irma Carvajal Flores,28434,Astratto Blanco 20X30 P25 Primera *1565*,15 days,1.0,587.0

0



    ---> Código a explorar 28430

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1125,577,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28430,[1537] Boquilla Ajustable De 8 Pies (2.40m) Co...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58247,1.0,55.0,Irma Carvajal Flores,28430,Boquilla Ajustable De 8 Pies (2.40m) Con Filtr...,15 days,1.0,<NA>

None



    ---> Código a explorar 10217

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1287,409,171,P00160 (AA 1038122),2024-01-15,5283,Chapa Industrias,10217,[85479] Tope Dexter Codo P/Piso #6861 L.A. *85...,12.0,36.6,AA 1038122,NaT,<NA>,Yamilet Blanco Salas

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6132,F2-VS/2024/00093,2024-01-12,22692,4.0,59.0,Yamilet Blanco Salas,10217,Tope Dexter Codo P/Piso #6861 L.A. *85479*,3 days,4.0,<NA>
1,3044,F2-VS/2024/00026,2024-01-08,11167,6.0,59.0,Yamilet Blanco Salas,10217,Tope Dexter Codo P/Piso #6861 L.A. *85479*,7 days,10.0,<NA>

None



    ---> Código a explorar 28428

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1119,581,219,P00208 (FCAB 480815),2024-01-15,5334,Electronica Pazeña,28428,[1527] Interruptor Magnético Para Puertas O Ve...,10.0,59.48,FCAB 480815,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58243,10.0,120.0,Irma Carvajal Flores,28428,Interruptor Magnético Para Puertas O Ventanas ...,15 days,10.0,581.0

0



    ---> Código a explorar 28431

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1126,578,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28431,[1538] Boquilla Ajustable De 6 Pies (1.8m) Con...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15421,F1-VS/2024/00345,2024-01-30,58248,1.0,55.0,Irma Carvajal Flores,28431,Boquilla Ajustable De 6 Pies (1.8m) Con Filtro...,15 days,1.0,<NA>

None



    ---> Código a explorar 26699

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1114,588,223,P00212 (MPIFCO 849),2024-01-15,5296,Madereria Pichonchas,26699,[5877] Pegamento Titebond II Premiun Azul 1L *...,1.0,219.83,MPIFCO 849,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10862,F1-VS/2024/00269,2024-01-22,40406,1.0,413.79,Mayra Angelica Parada Manjarrez,26699,Pegamento Titebond II Premiun Azul 1L *5877*,7 days,1.0,588.0

0



    ---> Código a explorar 13283

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1127,574,215,P00204 (B 83363),2024-01-15,5290,Maria Reyna Navarrete Cortez,13283,[3763] Triplay Caoba 1/8 4'*8' *3763*,5.0,270.27,B 83363,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7927,F1-VS/2024/00190,2024-01-17,29222,10.0,405.0,Irma Carvajal Flores,13283,Triplay Caoba 1/8 4'*8' *3763*,2 days,10.0,<NA>

None



    ---> Código a explorar 14147

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1131,566,212,P00201 (MPIFCO 716),2024-01-15,5296,Madereria Pichonchas,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,10.0,646.55,MPIFCO 716,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8417,F1-VS/2024/00203,2024-01-17,31128,4.0,905.0,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,2 days,4.0,<NA>

None



    ---> Código a explorar 26462

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1136,564,211,P00200 (295),2024-01-15,5167,Maria Rosa Castillo Castro,26462,[88744] Palo de Arco 1.50mts *88744*,900.0,8.63,295,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 900.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7630,F1-VS/2024/00176,2024-01-16,28184,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,150.0,564.0
1,7643,F1-VS/2024/00177,2024-01-16,28223,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,300.0,564.0
2,7644,F1-VS/2024/00178,2024-01-16,28226,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,450.0,564.0
3,7645,F1-VS/2024/00179,2024-01-16,28229,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,600.0,564.0
4,7646,F1-VS/2024/00180,2024-01-16,28232,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,750.0,564.0
5,7647,F1-VS/2024/00181,2024-01-16,28235,150.0,15.97,Mayra Angelica Parada Manjarrez,26462,Palo de Arco 1.50mts *88744*,1 days,900.0,564.0

5



    ---> Código a explorar 26810

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1139,558,207,P00196 (AZG 3302759),2024-01-15,5266,Costco De Mexico,26810,[47501] Paquete Pilas AA (40 pz) Duracell *47501*,8.0,322.64,AZG 3302759,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 8.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6746,F2-VS/2024/00104,2024-01-15,24974,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,0 days,4.0,558.0
1,6747,F2-VS/2024/00105,2024-01-15,24977,4.0,751.21,Brenda Luz Acosta Lopez,26810,Paquete Pilas AA (40 pz) Duracell *47501*,0 days,8.0,558.0

1



    ---> Código a explorar 8488

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1161,538,195,P00184 (A 27772),2024-01-15,5241,Jose Leobardo Corrales Acosta,8488,[2227] Fibra P/Mad. Verde M/Usos (5633) 72939 ...,36.0,9.17,A 27772,NaT,<NA>,Yamilet Blanco Salas

-> Cantidad 36.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6376,F2-VS/2024/00103,2024-01-13,23539,24.0,14.9,Yamilet Blanco Salas,8488,Fibra P/Mad. Verde M/Usos (5633) 72939 *2227*,2 days,24.0,538.0
1,4803,F2-VS/2024/00068,2024-01-11,17695,12.0,14.9,Yamilet Blanco Salas,8488,Fibra P/Mad. Verde M/Usos (5633) 72939 *2227*,4 days,36.0,538.0

1



    ---> Código a explorar 12223

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1162,536,194,P00183 (A 27761),2024-01-15,5241,Jose Leobardo Corrales Acosta,12223,"[14403] Mecate Ixtle Henequen 1/2"" HN 13mm (Kg...",39.7,115.95,A 27761,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 39.7

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,6144,F2-VS/2024/00095,2024-01-13,22728,40.0,195.25,Brenda Luz Acosta Lopez,12223,"Mecate Ixtle Henequen 1/2"" HN 13mm (Kg) *14403*",2 days,40.0,<NA>

None



    ---> Código a explorar 27031

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1147,551,203,P00192 (MX 4128231),2024-01-15,5161,Uline Shipping Supplies,27031,"[26509] Rueda Giratoria 4 X 1 1/4"" *26509*",12.0,310.29,MX 4128231,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10513,F1-VS/2024/00262,2024-01-22,39200,12.0,475.0,Irma Carvajal Flores,27031,"Rueda Giratoria 4 X 1 1/4"" *26509*",7 days,12.0,551.0

0



    ---> Código a explorar 13453

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1111,591,226,P00215 (LA 36607),2024-01-15,5143,Fymsa Baja Sur,13453,[1587] Cemento Gris Bulto (50kg) CE *1587*,1.0,322.7,LA 36607,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8415,F1-VS/2024/00202,2024-01-17,31116,2.0,461.95,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*,2 days,2.0,<NA>
1,8952,F1-VS/2024/00224,2024-01-18,33364,2.0,472.72,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*,3 days,4.0,<NA>
2,10862,F1-VS/2024/00269,2024-01-22,40407,1.0,461.95,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*,7 days,5.0,<NA>

None



    ---> Código a explorar 14628

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1105,600,230,P00219 (AAAC 27690),2024-01-15,5162,Pinturas Vare Operadora De La Baja,14628,[13894] Sellador Acrilico Transp. 12721 (19Lt)...,1.0,3063.71,AAAC 27690,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10862,F1-VS/2024/00269,2024-01-22,40378,1.0,5821.1,Mayra Angelica Parada Manjarrez,14628,Sellador Acrilico Transp. 12721 (19Lt) *13894*,7 days,1.0,600.0

0



    ---> Código a explorar 13943

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1037,665,248,P00237 (B 83446),2024-01-16,5290,Maria Reyna Navarrete Cortez,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,41.0,536.41,B 83446,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 41.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7668,F1-VS/2024/00184,2024-01-16,28301,16.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,0 days,16.0,665.0
1,7670,F1-VS/2024/00186,2024-01-16,28308,3.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,0 days,19.0,665.0
2,7671,F1-VS/2024/00187,2024-01-16,28312,2.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,0 days,21.0,665.0
3,7680,F1-VS/2024/00188,2024-01-16,28339,20.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,0 days,41.0,665.0
4,10208,F1-VS/2024/00258,2024-01-20,38061,2.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,4 days,43.0,NaN

3



    ---> Código a explorar 14156

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1038,666,248,P00237 (B 83446),2024-01-16,5290,Maria Reyna Navarrete Cortez,14156,[15293] Triplay Birch 3/4 4'*8' *15293*,69.0,723.19,B 83446,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 69.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7663,F1-VS/2024/00183,2024-01-16,28286,30.0,1487.07,Mayra Angelica Parada Manjarrez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,30.0,666.0
1,7669,F1-VS/2024/00185,2024-01-16,28304,30.0,1330.8,Mayra Angelica Parada Manjarrez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,60.0,666.0
2,7670,F1-VS/2024/00186,2024-01-16,28307,3.0,1330.8,Mayra Angelica Parada Manjarrez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,63.0,666.0
3,7671,F1-VS/2024/00187,2024-01-16,28311,6.0,1330.8,Mayra Angelica Parada Manjarrez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,69.0,666.0

3



    ---> Código a explorar 27756

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1040,663,247,P00236 (A 254),2024-01-16,5227,Anabell Hernandez Espinoza,27756,[22658] Pasta Covermix 509 (19Lt) Resanadora *...,2.0,2543.1,A 254,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12362,F1-VS/2024/00311,2024-01-24,46118,2.0,3426.72,Irma Carvajal Flores,27756,Pasta Covermix 509 (19Lt) Resanadora *22658*,8 days,2.0,663.0

0



    ---> Código a explorar 27101

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1041,664,247,P00236 (A 254),2024-01-16,5227,Anabell Hernandez Espinoza,27101,[25952] Pasta Corev Palladio 2343 (19Lt) Plas ...,2.0,5948.28,A 254,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12410,F1-VS/2024/00312,2024-01-24,46315,3.0,8017.25,Irma Carvajal Flores,27101,Pasta Corev Palladio 2343 (19Lt) Plas *25952*,8 days,3.0,<NA>

None



    ---> Código a explorar 11948

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1052,636,243,P00232 (C 261179),2024-01-16,5321,El Gran Tlapalero,11948,[1424] Chapa P/Cajon Ph #250-CH Cañ Chico C #3...,24.0,92.15,C 261179,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 24.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8242,F1-VS/2024/00195,2024-01-17,30492,12.0,165.0,Mayra Angelica Parada Manjarrez,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*,1 days,12.0,<NA>

None



    ---> Código a explorar 7545

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1069,611,235,P00224 (WA 12864),2024-01-16,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7545,"[3975] Pija C/Pl 10*1 1/2"" Smpfz (4000P/C) C#3...",600.0,0.38,WA 12864,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 600.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10862,F1-VS/2024/00269,2024-01-22,40386,500.0,0.62,Mayra Angelica Parada Manjarrez,7545,"Pija C/Pl 10*1 1/2"" Smpfz (4000P/C) C#30 *3975*",6 days,500.0,<NA>

None



    ---> Código a explorar 28051

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1095,609,233,P00222 (LA 36616),2024-01-16,5143,Fymsa Baja Sur,28051,[2011] Yeso maximo 40KG *2011*,1.0,174.52,LA 36616,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10862,F1-VS/2024/00269,2024-01-22,40408,1.0,276.18,Mayra Angelica Parada Manjarrez,28051,Yeso maximo 40KG *2011*,6 days,1.0,609.0

0



    ---> Código a explorar 28393

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1097,608,232,P00221 (W0000456606),2024-01-16,5157,Ferre-Pat,28393,[24704] Puntas Magnéticas Milwaukee 48-32-4564...,4.0,119.61,W0000456606,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7211,F1-VS/2024/00167,2024-01-15,26623,10.0,709.91,Mayra Angelica Parada Manjarrez,28393,Puntas Magnéticas Milwaukee 48-32-4564 *24704*,1 days,10.0,<NA>

None



    ---> Código a explorar 13842

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1058,622,240,P00229 (36767),2024-01-16,5378,Maderas Dimar,13842,[11143] Pistola P/Pintar Devilbis MGQ-500 *11143*,2.0,488.03,36767,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1475,F1-VS/2024/00021,2024-01-05,5431,1.0,749.79,Mayra Angelica Parada Manjarrez,13842,Pistola P/Pintar Devilbis MGQ-500 *11143*,11 days,1.0,<NA>

None



    ---> Código a explorar 14075

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1009,697,259,P00248 (B 83459),2024-01-17,5290,Maria Reyna Navarrete Cortez,14075,[40032] Triplay Birch 5/8 4'*8' *40032*,2.0,615.51,B 83459,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8413,F1-VS/2024/00200,2024-01-17,31110,5.0,960.6,Mayra Angelica Parada Manjarrez,14075,Triplay Birch 5/8 4'*8' *40032*,0 days,5.0,<NA>

None



    ---> Código a explorar 28477

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
985,741,269,P00258 (FAOMXPOS 22090685),2024-01-17,14806,OPERADORA OMX SA DE CV,28477,[1706] Silla Ejecutiva Olmo Negro *1706*,3.0,2585.34,FAOMXPOS 22090685,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,16263,F1-VS/2024/00360,2024-01-31,61704,1.0,3930.0,Irma Carvajal Flores,28477,Silla Ejecutiva Olmo Negro *1706*,14 days,1.0,<NA>

None



    ---> Código a explorar 13636

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
989,737,266,P00255 (A 22185),2024-01-17,5264,Maria Teresa Quezada Hernandez,13636,[13756] Tabla Americana 1x12x10 *13756*,8.0,327.59,A 22185,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 8.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9424,F1-VS/2024/00240,2024-01-19,35122,1.0,534.04,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*,2 days,1.0,<NA>
1,3950,F1-VS/2024/00102,2024-01-09,14373,8.0,541.82,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*,8 days,9.0,<NA>
2,1156,F1-VS/2024/00015,2024-01-04,4212,10.0,640.05,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*,13 days,19.0,<NA>

None



    ---> Código a explorar 13811

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1011,699,259,P00248 (B 83459),2024-01-17,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,19.0,443.34,B 83459,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 19.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,1156,F1-VS/2024/00015,2024-01-04,4210,6.0,750.9,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,13 days,6.0,<NA>

None



    ---> Código a explorar 14777

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
991,719,264,P00253 (SL 6785),2024-01-17,5181,Vector De Baja California,14777,"[20703] Usgi Radar 2x2x5/8"" LST *20703*",2.0,1595.79,SL 6785,NaT,Elsa Ivette Diaz Leyva,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15303,F1-VS/2024/00342,2024-01-29,57582,2.0,2525.0,Irma Carvajal Flores,14777,"Usgi Radar 2x2x5/8"" LST *20703*",12 days,2.0,719.0

0



    ---> Código a explorar 28460

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1014,692,256,P00245 (SL 6785),2024-01-17,5181,Vector De Baja California,28460,[1619] Crane Glasbord FRP Liso 19.mm 2x2 *1619*,15.0,162.07,SL 6785,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 15.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15303,F1-VS/2024/00342,2024-01-29,57583,15.0,255.0,Irma Carvajal Flores,28460,Crane Glasbord FRP Liso 19.mm 2x2 *1619*,12 days,15.0,692.0

0



    ---> Código a explorar 9946

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1017,688,253,P00242 (BBACF 264682),2024-01-17,5239,Tiendas Soriana,9946,"[2310] Pila duracell ""C"" *2310*",100.0,30.9,BBACF 264682,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 100.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7923,F1-VS/2024/00189,2024-01-17,29210,150.0,46.09,Irma Carvajal Flores,9946,"Pila duracell ""C"" *2310*",0 days,150.0,<NA>

None



    ---> Código a explorar 13283

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1015,690,255,P00244 (B 83432),2024-01-17,5290,Maria Reyna Navarrete Cortez,13283,[3763] Triplay Caoba 1/8 4'*8' *3763*,5.0,270.27,B 83432,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 5.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7927,F1-VS/2024/00190,2024-01-17,29222,10.0,405.0,Irma Carvajal Flores,13283,Triplay Caoba 1/8 4'*8' *3763*,0 days,10.0,<NA>

None



    ---> Código a explorar 9946

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1016,689,254,P00243 (BBABA 590633),2024-01-17,5239,Tiendas Soriana,9946,"[2310] Pila duracell ""C"" *2310*",50.0,30.9,BBABA 590633,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 50.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,7923,F1-VS/2024/00189,2024-01-17,29210,150.0,46.09,Irma Carvajal Flores,9946,"Pila duracell ""C"" *2310*",0 days,150.0,<NA>

None



    ---> Código a explorar 12756

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
922,813,290,P00279 (2000005281980027B),2024-01-18,5128,Mercado Libre,12756,[26164] Pila Panasonic Lto Crp2 *26164*,17.0,151.73,2000005281980027B,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 17.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9410,F2-VS/2024/00136,2024-01-19,35028,7.0,245.56,Brenda Luz Acosta Lopez,12756,Pila Panasonic Lto Crp2 *26164*,1 days,7.0,<NA>
1,3399,F2-VS/2024/00038,2024-01-08,12482,8.0,245.56,Brenda Luz Acosta Lopez,12756,Pila Panasonic Lto Crp2 *26164*,10 days,15.0,<NA>

None



    ---> Código a explorar 28491

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
926,810,287,P00276 (WA 12903),2024-01-18,5221,Distribuidor Mayorista De Tornillos De Yucatan...,28491,"[1739] Pija C/Pl 12*3"" CE *1739*",700.0,0.81,WA 12903,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 700.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9433,F2-VS/2024/00139,2024-01-19,35230,500.0,1.53,Brenda Luz Acosta Lopez,28491,"Pija C/Pl 12*3"" CE *1739*",1 days,500.0,810.0
1,9991,F2-VS/2024/00155,2024-01-20,37311,200.0,1.99,Brenda Luz Acosta Lopez,28491,"Pija C/Pl 12*3"" CE *1739*",2 days,700.0,810.0

1



    ---> Código a explorar 28158

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
927,808,286,P00275 (SJ 27248),2024-01-18,5143,Fymsa Baja Sur,28158,[14865] Cal (Bulto) *14865*,2.0,126.44,SJ 27248,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10669,F1-VS/2024/00266,2024-01-22,39753,2.0,179.53,Irma Carvajal Flores,28158,Cal (Bulto) *14865*,4 days,2.0,808.0

0



    ---> Código a explorar 13811

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
956,771,281,P00270 (B 83475),2024-01-18,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,22.0,443.34,B 83475,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 22.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8003,F1-VS/2024/00191,2024-01-17,29659,20.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,1 days,20.0,<NA>
1,8417,F1-VS/2024/00203,2024-01-17,31127,4.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,1 days,24.0,<NA>
2,9727,F1-VS/2024/00244,2024-01-19,36164,18.0,625.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,1 days,42.0,<NA>
3,5977,F1-VS/2024/00152,2024-01-12,21898,2.0,720.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,6 days,44.0,<NA>
4,3920,F1-VS/2024/00097,2024-01-09,14278,6.0,673.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*,9 days,50.0,<NA>

None



    ---> Código a explorar 14147

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
957,772,281,P00270 (B 83475),2024-01-18,5290,Maria Reyna Navarrete Cortez,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,6.0,609.41,B 83475,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8417,F1-VS/2024/00203,2024-01-17,31128,4.0,905.0,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,1 days,4.0,<NA>

None



    ---> Código a explorar 27920

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
960,770,280,P00269 (W0000457956),2024-01-18,5157,Ferre-Pat,27920,[20476] Dis. Austromex 4 1/2 x 3/64 x 7/8 #750...,10.0,53.9,W0000457956,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8988,F1-VS/2024/00227,2024-01-18,33526,50.0,73.5,Mayra Angelica Parada Manjarrez,27920,Dis. Austromex 4 1/2 x 3/64 x 7/8 #750 *20476*,0 days,50.0,<NA>

None



    ---> Código a explorar 28253

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
981,745,273,P00262 (2000005281984605),2024-01-18,5128,Mercado Libre,28253,[11508] Detector Tipo Lapiz 1AC-A1-II Mca Fluk...,1.0,602.59,2000005281984605,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,5066,F1-VS/2024/00123,2024-01-11,18616,1.0,1325.0,Mayra Angelica Parada Manjarrez,28253,Detector Tipo Lapiz 1AC-A1-II Mca Fluke *11508*,7 days,1.0,745.0

0



    ---> Código a explorar 13786

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
951,780,283,P00272 (A 103868),2024-01-18,5352,Luz Raquel Rodriguez Montoya,13786,"[13538] Tabla Americana 1"" X 12"" X 16' *13538*",9.0,524.14,A 103868,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 9.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8417,F1-VS/2024/00203,2024-01-17,31126,6.0,740.0,Irma Carvajal Flores,13786,"Tabla Americana 1"" X 12"" X 16' *13538*",1 days,6.0,780.0
1,8421,F1-VS/2024/00206,2024-01-17,31155,1.0,840.0,Irma Carvajal Flores,13786,"Tabla Americana 1"" X 12"" X 16' *13538*",1 days,7.0,780.0
2,8440,F1-VS/2024/00208,2024-01-17,31220,2.0,840.0,Irma Carvajal Flores,13786,"Tabla Americana 1"" X 12"" X 16' *13538*",1 days,9.0,780.0

2



    ---> Código a explorar 28496

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
801,933,297,P00286 (4HGFFI 179132),2024-01-19,5387,Home Depot Mexico,28496,[566] Emboquillador Fluido Y Sellado Rojo 10kg...,17.0,162.07,4HGFFI 179132,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 17.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9422,F1-VS/2024/00239,2024-01-19,35114,2.0,260.0,Irma Carvajal Flores,28496,Emboquillador Fluido Y Sellado Rojo 10kg *566*,0 days,2.0,933.0
1,9427,F1-VS/2024/00241,2024-01-19,35131,15.0,260.0,Irma Carvajal Flores,28496,Emboquillador Fluido Y Sellado Rojo 10kg *566*,0 days,17.0,933.0

1



    ---> Código a explorar 7543

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
648,1092,321,P00310 (WA 12941),2024-01-20,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7543,"[9364] Rondana Neopreno 1/4"" C#176 *9364*",113.0,0.2,WA 12941,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 113.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9727,F1-VS/2024/00244,2024-01-19,36165,150.0,0.6,Irma Carvajal Flores,7543,"Rondana Neopreno 1/4"" C#176 *9364*",1 days,150.0,<NA>

None



    ---> Código a explorar 14233

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
591,1150,346,P00335 (PA 61442),2024-01-22,5335,Casa Myers,14233,[18579] Cierra Puerta Ph #1406-AN #3480 *18579*,10.0,833.79,PA 61442,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,11089,F1-VS/2024/00282,2024-01-22,41196,5.0,1410.66,Irma Carvajal Flores,14233,Cierra Puerta Ph #1406-AN #3480 *18579*,0 days,5.0,<NA>

None



    ---> Código a explorar 28511

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
592,1149,345,P00334 (FCO 9404742),2024-01-22,5318,Soluciones En Madera El Roble,28511,"[1781] Morillo 3-4"" x 10 *1781*",12.0,168.11,FCO 9404742,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10599,F1-VS/2024/00264,2024-01-22,39523,10.0,296.9,Mayra Angelica Parada Manjarrez,28511,"Morillo 3-4"" x 10 *1781*",0 days,10.0,1149.0
1,10730,F1-VS/2024/00267,2024-01-22,39944,2.0,296.9,Mayra Angelica Parada Manjarrez,28511,"Morillo 3-4"" x 10 *1781*",0 days,12.0,1149.0

1



    ---> Código a explorar 14147

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
611,1130,341,P00330 (B 83501),2024-01-22,5290,Maria Reyna Navarrete Cortez,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,3.0,609.41,B 83501,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8995,F1-VS/2024/00228,2024-01-18,33554,3.0,982.75,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,4 days,3.0,1130.0
1,5924,F1-VS/2024/00146,2024-01-12,21712,10.0,1330.6,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,10 days,13.0,NaN
2,5112,F1-VS/2024/00126,2024-01-11,18778,2.0,1066.82,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,11 days,15.0,NaN
3,5113,F1-VS/2024/00127,2024-01-11,18782,4.0,969.85,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*,11 days,19.0,NaN

0



    ---> Código a explorar 27542

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
622,1119,336,P00325 (AZG 3306331),2024-01-22,5266,Costco De Mexico,27542,[24426] Toalla Microfibra Amarillo C/36pz *24426*,1.0,300.87,AZG 3306331,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15303,F1-VS/2024/00342,2024-01-29,57584,1.0,576.0,Irma Carvajal Flores,27542,Toalla Microfibra Amarillo C/36pz *24426*,7 days,1.0,1119.0

0



    ---> Código a explorar 11928

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
624,1117,334,P00323 (C 261588),2024-01-22,5321,El Gran Tlapalero,11928,[1426] Chapa P/Cajon Ph #250-C Cañ Largo C #33...,30.0,94.93,C 261588,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 30.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10917,F1-VS/2024/00273,2024-01-22,40603,15.0,203.0,Mayra Angelica Parada Manjarrez,11928,Chapa P/Cajon Ph #250-C Cañ Largo C #33 *1426*,0 days,15.0,<NA>

None



    ---> Código a explorar 28498

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
637,1101,327,P00316 (4HGFFI 179589),2024-01-22,5387,Home Depot Mexico,28498,[1749] Escalera Tijera Alum T-III #130796 Cupr...,1.0,1119.82,4HGFFI 179589,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15749,F1-VS/2024/00351,2024-01-30,59497,1.0,1702.13,Irma Carvajal Flores,28498,Escalera Tijera Alum T-III #130796 Cuprum *1749*,8 days,1.0,1101.0

0



    ---> Código a explorar 12677

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
638,1102,327,P00316 (4HGFFI 179589),2024-01-22,5387,Home Depot Mexico,12677,"[12887] Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",9.0,119.83,4HGFFI 179589,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 9.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13251,F1-VS/2024/00325,2024-01-25,49710,16.0,234.0,Irma Carvajal Flores,12677,"Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",3 days,16.0,<NA>

None



    ---> Código a explorar 28490

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
641,1099,325,P00314 (2000005301404071C),2024-01-22,5128,Mercado Libre,28490,[58211] Jgo Avellanadores #6 #8 #10 Dewalt *58...,1.0,280.17,2000005301404071C,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9060,F1-VS/2024/00232,2024-01-18,33767,1.0,602.76,Mayra Angelica Parada Manjarrez,28490,Jgo Avellanadores #6 #8 #10 Dewalt *58211*,4 days,1.0,1099.0

0



    ---> Código a explorar 14075

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
567,1176,365,P00354 (B 83477),2024-01-23,5290,Maria Reyna Navarrete Cortez,14075,[40032] Triplay Birch 5/8 4'*8' *40032*,3.0,615.51,B 83477,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8413,F1-VS/2024/00200,2024-01-17,31110,5.0,960.6,Mayra Angelica Parada Manjarrez,14075,Triplay Birch 5/8 4'*8' *40032*,6 days,5.0,<NA>

None



    ---> Código a explorar 14156

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
568,1175,364,P00353 (B 83520),2024-01-23,5290,Maria Reyna Navarrete Cortez,14156,[15293] Triplay Birch 3/4 4'*8' *15293*,2.0,723.19,B 83520,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8442,F1-VS/2024/00210,2024-01-17,31229,2.0,1100.0,Irma Carvajal Flores,14156,Triplay Birch 3/4 4'*8' *15293*,6 days,2.0,1175.0

0



    ---> Código a explorar 7671

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
570,1172,362,P00351 (WA 12978),2024-01-23,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7671,[3996] Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,1000.0,0.81,WA 12978,NaT,<NA>,Reyna Arriaga Flores

-> Cantidad 1000.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,11435,F1-CC/2024/01128,2024-01-23,42653,200.0,2.32,Reyna Arriaga Flores,7671,Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,0 days,200.0,<NA>

None



    ---> Código a explorar 28511

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
580,1162,358,P00347 (FCO 9404750),2024-01-23,5318,Soluciones En Madera El Roble,28511,"[1781] Morillo 3-4"" x 10 *1781*",4.0,168.11,FCO 9404750,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 4.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,11349,F2-VS/2024/00170,2024-01-23,42339,3.0,511.0,Brenda Luz Acosta Lopez,28511,"Morillo 3-4"" x 10 *1781*",0 days,3.0,<NA>

None



    ---> Código a explorar 28193

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
585,1157,353,P00342 (MPIFCO 1211),2024-01-23,5296,Madereria Pichonchas,28193,[13789] Pegamento Amar. Elmer'S 1Lt *13789*,1.0,200.0,MPIFCO 1211,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8456,F1-VS/2024/00217,2024-01-17,31281,1.0,339.0,Irma Carvajal Flores,28193,Pegamento Amar. Elmer'S 1Lt *13789*,6 days,1.0,1157.0
1,2523,F1-VS/2024/00042,2024-01-06,9205,1.0,339.0,Irma Carvajal Flores,28193,Pegamento Amar. Elmer'S 1Lt *13789*,17 days,2.0,NaN

0



    ---> Código a explorar 12026

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
587,1155,351,P00340 (9001035810),2024-01-23,5312,Refrigeracion Y Accesorios,12026,[918] Coilcleaner Adesa Limpieza Acido 3.7L *918*,10.0,113.16,9001035810,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12179,F1-VS/2024/00302,2024-01-24,45447,1.0,180.0,Irma Carvajal Flores,12026,Coilcleaner Adesa Limpieza Acido 3.7L *918*,1 days,1.0,<NA>
1,9281,F1-VS/2024/00236,2024-01-18,34546,10.0,172.0,Irma Carvajal Flores,12026,Coilcleaner Adesa Limpieza Acido 3.7L *918*,5 days,11.0,<NA>

None



    ---> Código a explorar 28519

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
588,1153,349,P00338 (2000005305184095C),2024-01-23,5128,Mercado Libre,28519,[1792] Cinta Unión Para Alfombras Sintéticas *...,1.0,443.97,2000005305184095C,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13247,F2-VS/2024/00196,2024-01-25,49681,3.0,695.0,Brenda Luz Acosta Lopez,28519,Cinta Unión Para Alfombras Sintéticas *1792*,2 days,3.0,<NA>

None



    ---> Código a explorar 14184

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
577,1164,359,P00348 (SJCFCO 1852),2024-01-23,5326,Madereria El Pino De Los Cabos,14184,[90057] Tablon americano 2*12*10 *90057*,2.0,758.62,SJCFCO 1852,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,3707,F2-VS/2024/00045,2024-01-09,13535,2.0,1293.11,Brenda Luz Acosta Lopez,14184,Tablon americano 2*12*10 *90057*,14 days,2.0,1164.0

0



    ---> Código a explorar 13331

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
552,1189,373,P00362 (MPIFCO 1281),2024-01-24,5296,Madereria Pichonchas,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,8.0,267.24,MPIFCO 1281,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 8.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10208,F1-VS/2024/00258,2024-01-20,38052,8.0,489.66,Mayra Angelica Parada Manjarrez,13331,Triplay Birch 1/4 4'*8' *16320*,4 days,8.0,1189.0

0



    ---> Código a explorar 12677

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
546,1198,376,P00365 (4HGFFI 181137),2024-01-24,5387,Home Depot Mexico,12677,"[12887] Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",6.0,119.83,4HGFFI 181137,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13251,F1-VS/2024/00325,2024-01-25,49710,16.0,234.0,Irma Carvajal Flores,12677,"Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",1 days,16.0,<NA>

None



    ---> Código a explorar 13943

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
553,1190,373,P00362 (MPIFCO 1281),2024-01-24,5296,Madereria Pichonchas,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,2.0,500.0,MPIFCO 1281,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10208,F1-VS/2024/00258,2024-01-20,38061,2.0,975.52,Mayra Angelica Parada Manjarrez,13943,Triplay Birch 1/2 4'*8' *15143*,4 days,2.0,1190.0

0



    ---> Código a explorar 10527

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
564,1178,367,P00356 (C 261591),2024-01-24,5321,El Gran Tlapalero,10527,[1418] Chapa Ph P/Cajon #21-C #1 *1418*,12.0,44.19,C 261591,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 12.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,11622,F1-VS/2024/00290,2024-01-23,43281,1.0,102.26,Mayra Angelica Parada Manjarrez,10527,Chapa Ph P/Cajon #21-C #1 *1418*,1 days,1.0,<NA>

None



    ---> Código a explorar 14772

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
555,1192,373,P00362 (MPIFCO 1281),2024-01-24,5296,Madereria Pichonchas,14772,[16313] Pegamento Titebond Verde1L *16313*,2.0,245.69,MPIFCO 1281,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10208,F1-VS/2024/00258,2024-01-20,38055,2.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,4 days,2.0,1192.0
1,6361,F1-VS/2024/00159,2024-01-13,23492,3.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*,11 days,5.0,NaN

0



    ---> Código a explorar 14287

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
554,1191,373,P00362 (MPIFCO 1281),2024-01-24,5296,Madereria Pichonchas,14287,[5211] Tabla Alder 1*8 (Cama) *5211*,2.0,965.52,MPIFCO 1281,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10208,F1-VS/2024/00258,2024-01-20,38053,2.0,2363.8,Mayra Angelica Parada Manjarrez,14287,Tabla Alder 1*8 (Cama) *5211*,4 days,2.0,1191.0

0



    ---> Código a explorar 28538

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
512,1232,387,P00376 (4HGFFI 181734),2024-01-25,5387,Home Depot Mexico,28538,[1835] Desbrozadora Black And Decker *1835*,2.0,978.45,4HGFFI 181734,NaT,<NA>,Nadia Santos Nava

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13365,F2-CC/2024/01727,2024-01-26,50326,1.0,1467.67,Nadia Santos Nava,28538,Desbrozadora Black And Decker *1835*,1 days,1.0,1232.0
1,13366,F2-CC/2024/01728,2024-01-26,50332,1.0,1467.67,Nadia Santos Nava,28538,Desbrozadora Black And Decker *1835*,1 days,2.0,1232.0

1



    ---> Código a explorar 14853

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
338,1428,429,P00418 (SJT 15661),2024-01-26,5294,Fierro Y Lamina Construccion,14853,[1371] Carda D/Alambre Trenzado 4 x 5/8 D-3171...,6.0,244.39,SJT 15661,NaT,<NA>,Yolanda Alejandra Rodriguez González

-> Cantidad 6.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13637,F2-CC/2024/01776,2024-01-26,51236,7.0,438.36,Yolanda Alejandra Rodriguez González,14853,Carda D/Alambre Trenzado 4 x 5/8 D-31712 *1371*,0 days,7.0,<NA>

None



    ---> Código a explorar 28519

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
339,1427,428,P00417 (2000005323200841B),2024-01-26,5128,Mercado Libre,28519,[1792] Cinta Unión Para Alfombras Sintéticas *...,2.0,474.14,2000005323200841B,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13247,F2-VS/2024/00196,2024-01-25,49681,3.0,695.0,Brenda Luz Acosta Lopez,28519,Cinta Unión Para Alfombras Sintéticas *1792*,1 days,3.0,<NA>

None



    ---> Código a explorar 13827

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
371,1395,419,P00408 (A 10813357),2024-01-26,5178,Sayer Lack Mexicana,13827,[14388] Laca Sayer LI-0103 (4Lt) Ind Amaril Oc...,2.0,449.4,A 10813357,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,10948,F1-VS/2024/00274,2024-01-22,40709,1.0,674.1,Mayra Angelica Parada Manjarrez,13827,Laca Sayer LI-0103 (4Lt) Ind Amaril Ocre *14388*,4 days,1.0,1395.0
1,10958,F1-VS/2024/00275,2024-01-22,40752,1.0,674.1,Mayra Angelica Parada Manjarrez,13827,Laca Sayer LI-0103 (4Lt) Ind Amaril Ocre *14388*,4 days,2.0,1395.0
2,4559,F1-VS/2024/00118,2024-01-10,16591,8.0,674.1,Mayra Angelica Parada Manjarrez,13827,Laca Sayer LI-0103 (4Lt) Ind Amaril Ocre *14388*,16 days,10.0,NaN

1



    ---> Código a explorar 12988

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
421,1345,404,P00393 (RI 27112592),2024-01-26,5375,Assa Abloy Mexico,12988,[9759] Chapa Yale P/Baño Esfera Ace Inox #8116...,10.0,171.6,RI 27112592,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15768,F1-VS/2024/00352,2024-01-30,59565,2.0,316.88,Mayra Angelica Parada Manjarrez,12988,Chapa Yale P/Baño Esfera Ace Inox #81169 *9759*,4 days,2.0,<NA>

None



    ---> Código a explorar 14263

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
430,1335,398,P00387 (F 303424),2024-01-26,5262,Chapas Y Maderas Importadas,14263,[55894] Bis. Tectus 340 3D 80Kg Negro *55894*,40.0,910.27,F 303424,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 40.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,13250,F1-VS/2024/00324,2024-01-25,49707,30.0,1500.0,Irma Carvajal Flores,14263,Bis. Tectus 340 3D 80Kg Negro *55894*,1 days,30.0,<NA>
1,4331,F1-VS/2024/00108,2024-01-10,15801,5.0,1901.0,Irma Carvajal Flores,14263,Bis. Tectus 340 3D 80Kg Negro *55894*,16 days,35.0,<NA>

None



    ---> Código a explorar 27412

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
318,1490,446,P00435 (4HGFFI 182762),2024-01-27,5387,Home Depot Mexico,27412,[24700] Canastilla Plastica C/Tapon PH-076 *24...,16.0,69.83,4HGFFI 182762,NaT,Gretel Gómez Alcázar,Brenda Luz Acosta Lopez

-> Cantidad 16.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,16448,F2-VS/2024/00227,2024-01-31,62320,16.0,164.0,Brenda Luz Acosta Lopez,27412,Canastilla Plastica C/Tapon PH-076 *24700*,4 days,16.0,1490.0

0



    ---> Código a explorar 14201

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
299,1507,456,P00445 (F 303629),2024-01-29,5262,Chapas Y Maderas Importadas,14201,[27002] Bisagra Tectus 240 3D Gris #274.100 (P...,60.0,763.53,F 303629,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 60.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15427,F2-VS/2024/00214,2024-01-30,58267,40.0,1275.14,Brenda Luz Acosta Lopez,14201,Bisagra Tectus 240 3D Gris #274.100 (Pz) *27002*,1 days,40.0,<NA>

None



    ---> Código a explorar 28489

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
301,1506,455,P00444 (FC-LPZ1-78711),2024-01-29,5285,Surtidora Mexicana Frontera,28489,[24686] Copa P/Desbaste Austromex #1284 G-80 *...,3.0,207.6225,FC-LPZ1-78711,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 3.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,9992,F2-VS/2024/00156,2024-01-20,37313,3.0,392.0,Brenda Luz Acosta Lopez,28489,Copa P/Desbaste Austromex #1284 G-80 *24686*,9 days,3.0,1506.0

0



    ---> Código a explorar 27101

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
311,1497,452,P00441 (A 267),2024-01-29,5227,Anabell Hernandez Espinoza,27101,[25952] Pasta Corev Palladio 2343 (19Lt) Plas ...,2.0,5790.52,A 267,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 2.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12410,F1-VS/2024/00312,2024-01-24,46315,3.0,8017.25,Irma Carvajal Flores,27101,Pasta Corev Palladio 2343 (19Lt) Plas *25952*,5 days,3.0,<NA>

None



    ---> Código a explorar 14770

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
315,1492,448,P00437 (WAI 53455),2024-01-29,5175,Cia Sherwin Williams,14770,[101001] Pintura Kem-Tone Mate 711 SW *101001*,1.0,2415.58,WAI 53455,NaT,<NA>,Irma Carvajal Flores

-> Cantidad 1.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8894,F1-VS/2024/00222,2024-01-18,33115,2.0,3623.37,Irma Carvajal Flores,14770,Pintura Kem-Tone Mate 711 SW *101001*,11 days,2.0,<NA>

None



    ---> Código a explorar 14156

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
158,1652,473,P00462 (SJCFCO 2507),2024-01-30,5326,Madereria El Pino De Los Cabos,14156,[15293] Triplay Birch 3/4 4'*8' *15293*,13.0,724.14,SJCFCO 2507,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 13.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,15509,F2-VS/2024/00220,2024-01-30,58566,10.0,1248.62,Brenda Luz Acosta Lopez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,10.0,1652.0
1,15509,F2-VS/2024/00220,2024-01-30,58573,3.0,1248.62,Brenda Luz Acosta Lopez,14156,Triplay Birch 3/4 4'*8' *15293*,0 days,13.0,1652.0

1



    ---> Código a explorar 26634

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
121,1694,488,P00477 (SJ 36871),2024-01-31,5369,Acyma Del Noroeste,26634,[70045] Pija autorr. p/durock 1 1/4 *70045*,6000.0,0.43,SJ 36871,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 6000.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,16222,F2-VS/2024/00224,2024-01-31,61567,5000.0,0.66,Brenda Luz Acosta Lopez,26634,Pija autorr. p/durock 1 1/4 *70045*,0 days,5000.0,1694.0
1,16226,F2-VS/2024/00225,2024-01-31,61579,1000.0,0.7,Brenda Luz Acosta Lopez,26634,Pija autorr. p/durock 1 1/4 *70045*,0 days,6000.0,1694.0

1



    ---> Código a explorar 28535

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
114,1701,494,P00483 (MX 4169825),2024-01-31,5161,Uline Shipping Supplies,28535,[1829] Cartucho P/Mascarilla Mod. 6006 3M (2pz...,10.0,493.86,MX 4169825,NaT,<NA>,Brenda Luz Acosta Lopez

-> Cantidad 10.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,12803,F2-VS/2024/00190,2024-01-25,48161,10.0,895.0,Brenda Luz Acosta Lopez,28535,Cartucho P/Mascarilla Mod. 6006 3M (2pz) *1829*,6 days,10.0,1701.0

0



    ---> Código a explorar 27920

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
5,1808,496,P00485 (W0000459056),2024-01-31,5157,Ferre-Pat,27920,[20476] Dis. Austromex 4 1/2 x 3/64 x 7/8 #750...,40.0,40.13,W0000459056,NaT,<NA>,Mayra Angelica Parada Manjarrez

-> Cantidad 40.0

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name,diff,cumsum,line_id
0,8988,F1-VS/2024/00227,2024-01-18,33526,50.0,73.5,Mayra Angelica Parada Manjarrez,27920,Dis. Austromex 4 1/2 x 3/64 x 7/8 #750 *20476*,13 days,50.0,<NA>

None

In [69]:
pd.concat([None, wep])

   line_id  fact_line_id
0      5.0         11002

In [25]:
match_3 = (
    pd.merge_asof(
        left = compras_especiales_restantes_after_match_1.sort_values('order_date'), 
        right = ventas_restantes_after_match_1.sort_values('invoice_date'),
        
        left_by = ['product_id_pp', 'vendedora', 'product_qty'], 
        right_by = ['product_id', 'salesperson_name', 'quantity'], 
        
        left_on = 'order_date', 
        right_on = 'invoice_date', 

        direction = 'nearest',
        tolerance = pd.Timedelta(days=3))
)

In [26]:
match_3.loc[(~match_3['fact_line_id'].isna())]

Empty DataFrame
Columns: [line_id, order_id, order_name, order_date, partner_id_x, partner_name_x, product_id_pp, product_name_x, product_qty, product_cost, partner_fact_ref, partner_fact_date, capturista, vendedora, fact_doc_id, name, invoice_date, state, invoice_origin, module_origin, pos_doc_id, move_type, reversal_move_id, reversed_entry_id, journal_id, company_id, partner_id_y, partner_name_y, salesperson_id, salesperson_name, active, sale_team_id, sale_team_description, business_model, warehouse, fact_line_id, product_id, product_name_y, prod_codigo, prod_linea, quantity, price_unit, discount, price_subtotal]
Index: []

[0 rows x 44 columns]

In [ ]:
wep = compras_especiales_sin_ventas['product_id_pp'].unique()
for prod in wep:
    if ventas_restantes_after_match_1.loc[ventas_restantes_after_match_1['product_id'] == prod, cols_vent].empty:
        print(f'    ---> Código a explorar {prod}')
        display(ventas_restantes_after_match_1.loc[ventas_restantes_after_match_1['product_id'] == prod, cols_vent])
        display(compras_especiales_restantes_after_match_1.loc[compras_especiales_restantes_after_match_1['product_id_pp'] == prod])
        print('\n\n')
        break